prototypage/LG476_pinname.org
#+title: Prototypage (rapide)
#+description: prototypage rapide
#+author: remi.griot@efrei.fr
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+OPTIONS: num:nil
#+LINK_UP: 
#+LINK_HOME: index.html

Dans Keil Studio, le fichier definissant le nom des broches du composant est \\
TARGET​_STM​/TARGET​_STM32L4​/TARGET​_STM32L476xG/pinNames.h \\

Voici un tableau permettant de faire le lien entre les broches du composants, les noms utilisés par Keil et le connecteur au format Arduino
 situé sur la carte.

| Pin Name (Keil) | Arduino | Autre nom |
|-----------------+---------+-----------|
| PA​_0  ​          |         |           |
| PA​_1            |         |           |
| PA​_2            |         |           |
| PA​_3            |         |           |
| PA​_4            |         |           |
| PA​_5            |         | LED1      |
| PA​_6            |         |           |
| PA​_7            |         |           |
| PA​_8            |         |           |
| PA​_9            |         |           |
| PA​_10           |         |           |
| PA​_11           |         |           |
| PA​_12           |         |           |
| PA​_13           |         |           |
| PA​_14           |         |           |
| PA​_15           |         |           |
| PB​_0            |         |           |
| PB​_1            |         |           |
| PB​_2            |         |           |
| PB​_3            |         |           |
| PB​_4            |         |           |
| PB​_5            |         |           |
| PB​_6            |         |           |
| PB​_7            |         |           |
| PB​_8            |         |           |
| PB​_9            |         |           |
| PB​_10           |         |           |
| PB​_11           |         |           |
| PB​_12           |         |           |
| PB​_13           |         |           |
| PB​_14           |         |           |
| PB​_15           |         |           |
| PC​_0            |         |           |
| PC​_1            |         |           |
| PC​_2            |         |           |
| PC​_3            |         |           |
| PC​_4            |         |           |
| PC​_5            |         |           |
| PC​_6            |         |           |
| PC​_7            |         |           |
| PC​_8            |         |           |
| PC​_9            |         |           |
| PC​_10           |         |           |
| PC​_11           |         |           |
| PC​_12           |         |           |
| PC​_13           |         | BUTTON1   |
| PC​_14           |         |           |
| PC​_15           |         |           |
| PD​_2            |         |           |
| PH​_0            |         |           |
| PH​_1            |         |           |
